{"keys":[{"path":["title"],"id":"title","weight":1,"src":"title","getFn":null},{"path":["body"],"id":"body","weight":1,"src":"body","getFn":null}],"records":[{"i":0,"$":{"0":{"v":"This page has not yet sprouted","n":0.408},"1":{"v":"[Dendron](https://dendron.so/) (the tool used to generate this site) lets authors selective publish content. You will see this page whenever you click on a link to an unpublished page\n\n![](https://foundation-prod-assetspublic53c57cce-8cpvgjldwysl.s3-us-west-2.amazonaws.com/assets/images/not-sprouted.png)","n":0.189}}},{"i":1,"$":{"0":{"v":"Правила оформления","n":0.707},"1":{"v":"\n> 💡 **СОВЕТ:** Текст совета\n\n> ⚠️ **ПРЕДУПРЕЖДЕНИЕ:** Текст предупреждения","n":0.333}}},{"i":2,"$":{"0":{"v":"ABAP","n":1},"1":{"v":"\nТут будет про ABAP","n":0.5}}},{"i":3,"$":{"0":{"v":"Инструкции пользователя","n":0.707},"1":{"v":"\nТут будут инструкции","n":0.577}}},{"i":4,"$":{"0":{"v":"LSMW","n":1},"1":{"v":"\nLSMW – это инструмент для переноса из исторической системы в SAP. Часто LSMW используется как инструмент массового ввода. Данные могут быть введены с помощью Batch Input, Direct Input, BAPIs или IDocs.\n\n## Принцип работы LSMW\n\n![Принцип работы LSMW](assets/images/lsmw-scheme.png)\n\n## Основные функции LSMW\n\n* Импорт данных (данные из файлов, электронных таблиц).\n* Преобразование данных в необходимый формат.\n* Импорт данных в SAP систему.\n\n## Преимущества\n\n* LSMW – часть SAP системы не зависимая от платформы\n* Большое количество возможностей по преобразованию данных\n* Поддержка основных технологий ввода: Bath Input, Direct Input, BAPIs, IDocs.\n* Удобный путеводитель по миграции данных\n* Является бесплатным инструментом для партнеров SAP\n\n\n## Перед использованием LSMW\n\n* Убедитесь, что SAP система окончательно настроена и готова к вводу\n* Решите, имеет ли смысл использовать инструмент, его использование оправдано на больших объемах данных. Скорость импорта для режима Direct Input и Bath Input примерно 10000 записей в час, величина может меняться в зависимости от аппаратной части сервера.\n* Определитесь с транзакциями в SAP системе, через которые будете выполнять импорт данных.  Созданы ли стандартные объекты Direct Input, Batch Input, есть ли необходимые BAPI.\n* Протестируйте выбранные транзакции вручную, определите, какие поля являются обязательными к заполнению.\n* Учтите, что LSMW не извлекает данные из внешних систем, их необходимо предварительно подготовить. Формат файла должен соответствовать возможностям чтения файлов LSMW. Например: кодировка должна быть либо ASCII или IBM.\n* Определитесь с методом импорта данных (BAPI, Direct Input и т.п.).\n\n## Предварительная настройка\n\nУбедитесь что у пользователя, под которым будет происходить импорт, достаточные полномочия:\n\nУровень авторизации | Профиль | Функции\n--------------------|---------|--------\nПросмотр | B_LSMW_SHOW | Пользователю разрешается просматривать все проекты LSMW\nВыполнение | B_LSMW_EXEC | Пользователь может выполнять и редактировать шаги проектов\nИзменение | B_LSMW_CHG | Пользователь обладает полномочиями на просмотр объекта LSMW, импорт и чтение данных.\nАдминистрирование | B_LSMW_ALL | Все полномочия на LSMW\n\n# Запуск\n\nДля начала работы запустите тразакцию ```LSMW``` .\n\n![Селекционный экран LSMW](assets/images/2022-07-01-22-22-20.png)\n\nТут:\n\n* Project – имя проекта, например «Упр. закупками и запасами»\n* Subproject – имя подпроекта, например «Движение запасов»\n* Object – имя объекта LSMW который включает все операции по переносу данных, например «Перемещение остатков».\n\nС помощью кнопок на начальном экране можно:\n\n* Запустить проект на выполнение.\n* Создать новый проект, объект.\n* Изменить проект.\n* Просмотреть все объекты LSMW в системе.\n* Просмотреть все свои объекты.\n* Просмотреть все объекты к проекту.\n* Изменить документацию к проекту.\n## Начало работы \nПосле выбора (создания) проекта, подпроекта и объекта LSMW нажмите ENTER, вы попадете на экран определения шагов для объекта.\n\n![LSMW steps](assets/images/2022-07-02-11-10-09.png)\n\nТут:\n\n* С помощью кнопки Personal Menu вы определяете, какие шаги будут использоваться в объекте. \n* Кнопка Object Overview позволяет посмотреть всю информацию по выбранному объекту.  \n* Action Log – просмотр истории изменений, запусков. \n* Execute – выполнить выбранный шаг. \n* Для изменения шагов выберите Double Click = Change.\n\n## Администрирование\n\nДля копирования, изменения, удаления объектов, проектов и подпроектов необходимо перейти в администрирование: _Go to -> Administration._\n","n":0.048}}},{"i":5,"$":{"0":{"v":"Движение запасов","n":0.707},"1":{"v":"\nТут допишу позже","n":0.577}}},{"i":6,"$":{"0":{"v":"Шаги LSMW","n":0.707},"1":{"v":"\nПосле запуска LSMW вы попадете на экран определения шагов для объекта.\n\n![LSMW steps](assets/images/2022-07-02-11-10-09.png)","n":0.289}}},{"i":7,"$":{"0":{"v":"Specify Files","n":0.707},"1":{"v":"\n# Определение файлов\n\nНа данном шаге определяются файлы:\n\n* С вашими данными (Legacy Data)\n* Файл с правилами чтения данных …lsmw.read ставится автоматически\n* Файл с правилами преобразования данных …lsmw.conv ставится автоматически\n\n![Определение файлов](assets/images/2022-07-02-12-20-52.png)\n\nПри присвоении файла с данными можно выбрать:\n\n* Находится ли в файле содержимое одной структуры, либо файл содержит несколько структур (Data for one source structure или Data for multiple source structures)\n* Определить разделители в файле между полями (; tab и др.)\n* Содержит ли файл названия полей (Field names at start of file, необходимо чтобы имена совпадали с именами в пользовательской структуре)\n* Совпадает ли порядок полей в файле с порядком в пользовательской структуре (Field Order Matches Source Structure Definition)\n* Тип файла (Текстовый, бинарный) и кодовая страница по умолчанию (ASCII или IBM).\n\n![Параметры файла для загрузки](assets/images/2022-07-02-12-23-30.png)","n":0.091}}},{"i":8,"$":{"0":{"v":"Read Data","n":0.707},"1":{"v":"\n# Чтение данных\n\nНа данном шаге определяется количество записей, которые необходимо считать (Transaction Number).  Если при определении полей структуры было указано что поле должно показываться на экране выбора чтения/конвертации данных, так же его необходимо заполнить. Так же задаются правила для преобразования чисел и дат.\n\n![Чтение данных](assets/images/2022-07-02-12-30-12.png)","n":0.151}}},{"i":9,"$":{"0":{"v":"Display Read Data","n":0.577},"1":{"v":"\n# Просмотр считанных данных\n\nНа данном шаге отображаются считанные из файлов данные.\n","n":0.302}}},{"i":10,"$":{"0":{"v":"Display Converted Data","n":0.577},"1":{"v":"\n# Просмотр присвоений после конвертации\n\nНа данном шаге показываются все присвоения после конвертации данных.\n","n":0.277}}},{"i":11,"$":{"0":{"v":"Define Structure Relations","n":0.577},"1":{"v":"\n# Определение связей структур\n\nНа данном шаге определяется связь между структурами объекта импорта (Поля в структурах BAPI, поля для пакетного ввода и т.п.) и пользовательскими структурами. В приведенном выше примере структуры из пакетного ввода: BGR00, BKN00, BKNA1, BKNB1 будут заполнены из пользовательской структуры CUSTOMER_HEADER, структура BKNVK из CUSTOMER_CONTACTS. Обратите внимание на то, что многие программы пакетного ввода содержат структуры BGR00 и BI000, они должны быть заполнены всегда.\n\n![Определение связей структур](assets/images/2022-07-02-11-53-32.png)\n","n":0.121}}},{"i":12,"$":{"0":{"v":"Define Source Structures","n":0.577},"1":{"v":"\n# Определение пользовательских структур\n\nНа данном шаге определяются имена пользовательских структур их описания и иерархия. Одна структура может включать несколько других, которые в свою очередь могут включать другие и т.д. Пользовательская структура заполняется из внешних данных, после чего используется для переноса данных в SAP систему.\n\n![Определение пользовательских структур](assets/images/2022-07-02-11-41-01.png)\n\n\n","n":0.147}}},{"i":13,"$":{"0":{"v":"Define Source Fields","n":0.577},"1":{"v":"\n# Определение полей для структур\n\nЭтот шаг определяет, из каких полей состоят пользовательские структуры. При создании поля можно определить его тип, длину, имя, описание. Используя параметр «Selection Parameter for Import/Convert data» мы определяем, будет ли данное поле появляться на экране в шагах чтения, конвертации данных, если да то данные из файла будут считаны в соответствии с введенным значением в эти поля. Структуру можно скопировать из внешнего файла, репозитария, другого объекта. При копировании из внешнего файла с разделением полей табуляцией можно воспользоваться Excel.\n\n![Определение полей для структур](assets/images/2022-07-02-11-48-53.png)","n":0.109}}},{"i":14,"$":{"0":{"v":"Define Object Attributes","n":0.577},"1":{"v":"\n# Определение атрибута объекта\n\n![Определение атрибута объекта](assets/images/2022-07-02-11-34-13.png)\n\n### Правила импорта данных:\n\n* Once-Only: однократно.\n* Periodic: с периодичностью (необходимо настроить шаг Frame Program for Periodic Data Transfer).\n\n### Режимы импорта данных:\n\n* Standard/ Batch Input: заранее подготовленные программы.\n* Batch Input Recording:  ранее созданная запись пакетного ввода.\n* BAPI:  использование методов бизнес объектов (BAPI).\n* IDOC: использование любых функциональных модулей Inbound IDOC.\n","n":0.137}}},{"i":15,"$":{"0":{"v":"Define Fixed Values, Translations, User-Defined","n":0.447},"1":{"v":"\nНа шаге этом с помощью правил преобразования (Translations) можно определить, чем будет заменены значения из исходных структур, определять правила как для конкретных значений, так и для диапазонов. Кроме того на этом шаге определяются константы используемые на предыдущем (Fixed Values) и кодировки которые вызываются не однократно (User-written routine).\n\n![Define Fixed Values, Translations, User-Defined](assets/images/2022-07-02-12-17-41.png)","n":0.14}}},{"i":16,"$":{"0":{"v":"Define Field Mapping and Conversion Rules","n":0.408},"1":{"v":"\n# Определение связей и правил преобразования\n\nНа данном шаге определяется связь между полями пользовательских структур и полями структур назначения (Полями пакетного ввода, BAPI и др.), а так же правила преобразования. Все поля структур назначения, которые были заполнены на предыдущем шаге, будут отображены на этом экране.\n\n![Определение связей и правил преобразования](assets/images/2022-07-02-12-05-46.png)\n\n### Поля содержат следующую информацию:\n* Описание поля\n* Присвоенное поле из структуры назначения\n* Правило, по которому присваивается значение полю (Константа, пустое, присвоение и т.п.)\n* Код программы преобразования\n\nНекоторые поля являются техническими и заполняются системой автоматически, правило для них присваивается как Default Settings (зеленые записи).  Изменение значений данных полей может повлиять на ход выполнения импорта.\n\nСистема позволяет автоматически сделать присвоение полей, в случае если их имена совпадают: _Extras -> Auto-field Mapping_.\n\n## Правила присвоения полей\n\n![Правила присвоения полей](assets/images/2022-07-02-12-13-26.png)\n\n* **Initial**: Пустое значение для поля. Когда выбрано данное правило значение поля может принимать  следующие значения: для стандартного пакетного ввода – пустое символьное значение '', для записи пакетного ввода '/', для BAPI или IDoc для символьных полей '', для полей числовых '0..00'.\n* **Move**: Работает так же, как и ABAP команда MOVE.\n* **Constant**: Значение по умолчанию.\n* **Fixed value (reusable)**:  Присваивается значение переменной определенной на шаге Maintain Fixed Values, Translations, User-Defined Routine.\n* **Translation (reusable)**: Определяется порядок преобразования поля, само преобразование определяется в шаге Maintain Fixed Values, Translations, User-Defined Routine.\n* **User-written routine (reusable)**: Определяется имя кодировки для поля, сама кодировка так же определяется на шаге Maintain Fixed Values, Translations, User-Defined Routine.\n* **Prefix**: Задается значение, которое должно быть перед содержимым поля.\n* **Suffix**: Задается значение, которое должно быть после содержимого поля.\n* **Concatenation**: Вы можете задать объединение двух или нескольких исходных полей в одно поле назначения.\n* **Transfer left-justified**: записать содержимое с выравниванием по левому краю.\n* **ABAP coding**: задает кодировку ABAP для преобразования поля.  В кодировке можно использовать все поля исходной структуры, глобальные переменные, глобальные функции.\n* **XField**: специальная функция для IDocs и BAPI объектов. Функция заполняет так называемые X-структуры (структуры изменений для BAPI функций). В случае если поле было изменено, соответствующее поле X структуры должно иметь значение «Х».","n":0.056}}},{"i":17,"$":{"0":{"v":"Data Import","n":0.707},"1":{"v":"\n# Импорт данных\n\nВ зависимости от типа объекта LSMW далее будут отображены следующие шаги:\n\n* **Standard batch input or Recordings**:   Run Batch Input Session – создание сессии пакетного ввода, Run batch input session – запуск сессии пакетного ввода.\n* **Standard direct input**: Start direct input session – запуск сессии direct input.\n* **BAPI** или **IDOCs**: Start IDoc Creation, Start IDoc Processing, Create IDoc Overview, Start IDoc processing.\n\nПосле выполнения шагов по импорту данных, если все шаги были правильно определены, данные будут записаны в SAP систему.","n":0.112}}},{"i":18,"$":{"0":{"v":"Convert Data","n":0.707},"1":{"v":"\n# Конвертация данных\n\nНа данном этапе производится преобразование считанных данных в поля объекта LSMW. (BAPI, поля Batch input и т.п.). Если в пользовательской структуре были поля указанные как поля ввода, необходимо их так же ввести.\n","n":0.171}}},{"i":19,"$":{"0":{"v":"Assign Files","n":0.707},"1":{"v":"\n# Присвоение файлов структурам\n\nНа данном этапе задается из какого файла будет читаться структура. Если структура одна данный шаг можно пропустить.\n\n![Присвоение файлов структурам](assets/images/2022-07-02-12-27-18.png)\n","n":0.213}}},{"i":20,"$":{"0":{"v":"Начало","n":1},"1":{"v":"\nТут будет обзор SAP\n","n":0.5}}},{"i":21,"$":{"0":{"v":"Интерфейс пользователя","n":0.707}}},{"i":22,"$":{"0":{"v":"Установка SAP Logon","n":0.577},"1":{"v":"\nТут будет инструкция как установить SAP Logon","n":0.378}}},{"i":23,"$":{"0":{"v":"SAP.wiki","n":1},"1":{"v":"\nГлавная страница","n":0.707}}}]}
